rusttick/weeBell_bluetooth/hwtest/sdkconfig.defaults
# ESP32 Audio Kit V2.2: ESP32-D0WD-V3 rev 3, 4 MB flash (Zbit 0x5e/0x4016).
CONFIG_IDF_TARGET="esp32"

# Flash: 4 MB, ESP-IDF default DIO at 40 MHz. The flash baud is not a config option under idf.py: use -b 921600.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

# Same CPU speed and compiler optimization as the main firmware (gcore_pots_bt/sdkconfig), so timing and CPU-load
# measurements (`bt bench`, the SD and call-audio tests) mean the same thing there. The flash stays at DIO 40 MHz: the main
# firmware's QIO 80 MHz was chosen for a different board and is unverified on this one.
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Console on UART0 at 115200 (through the CP2102).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y

# The main firmware requires chip revision 3 or later; this board is revision 3.
CONFIG_ESP32_REV_MIN_3=y

# Bluetooth handsfree (stage 9): the same settings as the main firmware (gcore_pots_bt/sdkconfig) -- classic BT only,
# HFP client, voice data through HCI, wide-band (mSBC) allowed -- except SSP is ON here (the main firmware has it off;
# the passkey-entry pairing design needs it).
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=2
CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN=2
CONFIG_BTDM_CTRL_BR_EDR_SCO_DATA_PATH_HCI=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_HFP_ENABLE=y
CONFIG_BT_HFP_CLIENT_ENABLE=y
CONFIG_BT_HFP_AUDIO_DATA_PATH_HCI=y
CONFIG_BT_HFP_WBS_ENABLE=y
CONFIG_BT_SSP_ENABLED=y
# The Bluetooth stack makes the app larger than the default 1 MB factory partition.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# SD card (stage 8): long file names (the clip IDs are longer than 8.3), needed to test hundreds of named files.
# To compare seek times, set CONFIG_FATFS_USE_FASTSEEK=y (menuconfig: Component config > FAT Filesystem support).
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# PSRAM (stage 3): 64 Mbit chip, auto-detected. Keep booting if it is not found, so the failure is
# reported by the app instead of aborting in the bootloader.
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
